pegasus/test/wetest/wsman/Put/Put_NotFound01.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">
<s:Header><a:To>http://localhost/wsman</a:To>
<w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/PG_TestPropertyTypes</w:ResourceURI>
<a:ReplyTo><a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address></a:ReplyTo>
<a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/Put</a:Action>
<a:MessageID>uuid:00000000-0000-0000-0005-000000000002</a:MessageID>
<w:Locale xml:lang="en-US" s:mustUnderstand="false" /><w:SelectorSet>
<!-- Specifies an invalid key property value -->
<w:Selector Name="InstanceId">100</w:Selector>
<w:Selector Name="CreationClassName">PG_TestPropertyTypes</w:Selector>
<w:Selector Name="__cimnamespace">test/static</w:Selector></w:SelectorSet>
</s:Header>
<s:Body><class:PG_TestPropertyTypes xmlns:class="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/PG_TestPropertyTypes">
        <class:CreationClassName>PG_TestPropertyTypes</class:CreationClassName>
        <class:InstanceId>1</class:InstanceId>
        <class:PropertyString>WSMInstance</class:PropertyString>
        <class:PropertyUint8>8</class:PropertyUint8>
        <class:PropertyUint16>16</class:PropertyUint16>
        <class:PropertyUint32>32</class:PropertyUint32>
        <class:PropertyUint64>64</class:PropertyUint64>
        <class:PropertySint8>-8</class:PropertySint8>
        <class:PropertySint16>-16</class:PropertySint16>
        <class:PropertySint32>-32</class:PropertySint32>
        <class:PropertySint64>-64</class:PropertySint64>
        <class:PropertyBoolean>false</class:PropertyBoolean>
        <class:PropertyReal32>32.0</class:PropertyReal32>
        <class:PropertyReal64>65.0</class:PropertyReal64>
        <class:PropertyDatetime>20010515104354.000000:000</class:PropertyDatetime>
</class:PG_TestPropertyTypes></s:Body></s:Envelope>
